//////////////////////////////////////////////////////////////////////
// Скрипт для поиска файлов баз данных на указанных дисках
// Список дисков нужно передавать в коммандной строке просто буквами без дополнительных символов - например D C E
// Скрипт ищет эти буквы дисков среди системных и если находит, то запускает поиск по ним

Перем мМассивДисковДляПоиска;
Перем мМассивНайденныеФайлы;

// Процедура подготавливает массив дисков для поиска файлов в соответствии с переданными буквами в параметрах коммандной строки
//
Процедура ПодготовитьМассивДисковДляПоиска()
	
	мМассивДисковДляПоиска = Новый Массив();
	
	// Читаем аргументы коммандной строки
	// в которых передаются буквы дисков для поиска
	ВсеДиски = Ложь;
	Если АргументыКоманднойСтроки.Количество() = 0 Тогда
		ТекстСообщения = "##############################################
			|#	Задайте буквы дисков для поиска просто буквами в верхнем регистре
			|#	 без дополнительных символов - например D C E
			|#	 или укажите один из следующих параметров
			|#	 -all - для поиска на всех дисках в системе (! Может занять длительное время !)";
		Сообщить(ТекстСообщения);
	Иначе
		Если АргументыКоманднойСтроки[0] = "-all" Тогда
			ВсеДиски = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// Ищем среди логических дисков системы те, что переданы в командной строке
	СИ = Новый СистемнаяИнформация();
	Для Каждого ИмяДиска Из СИ.ИменаЛогическихДисков Цикл
		Если НЕ ВсеДиски Тогда
			Если АргументыКоманднойСтроки.Найти(Лев(ИмяДиска, 1)) = Неопределено Тогда
				Продолжить
			КонецЦикла;
		КонецЕсли;
		мМассивДисковДляПоиска.Добавить(ИмяДиска);
	КонецЦикла;
КонецПроцедуры

// Процедура ищет файлы на дисках
//
Процедура НайтиФайлыНаДисках()
	
	мМассивНайденныеФайлы = Новый Массив();
	
	Для каждого ИмяДиска Из мМассивДисковДляПоиска Цикл
		МассивКорневыхКаталоговДиска = НайтиФайлы(ИмяДиска, ПолучитьМаскуВсеФайлы(), Ложь);
		Для каждого КаталогИзМассива Из МассивКорневыхКаталоговДиска Цикл
			Если НЕ КаталогИзМассива.ЭтоКаталог() Тогда Продолжить КонецЕсли;
			ТекущийКаталогИмя = КаталогИзМассива.ПолноеИмя;
			Сообщить("Поиск в каталоге: "+ТекущийКаталогИмя);
			МассивФайлов = НайтиФайлы(ТекущийКаталогИмя, "*.1CD", Истина);
			Для каждого ФайлИзМассива Из МассивФайлов Цикл
				мМассивНайденныеФайлы.Добавить(ФайлИзМассива);
			КонецЦикла;
		КонецЦикла;

		ПутьФайл = ОбъединитьПути(КаталогВременныхФайлов(),СтрШаблон("1C_search_%1.txt",Лев(ИмяДиска,1)));
	
		ТекстДокумент = Новый ЗаписьТекста;
		ТекстДокумент.Открыть(ПутьФайл);
		Для каждого Элем Из МассивФайлов Цикл
			ТекстДокумент.ЗаписатьСтроку(Элем);
		КонецЦикла;

		Сообщить(СтрШаблон("Файл результатов: %1", ПутьФайл));	

	КонецЦикла;
	
КонецПроцедуры


ПодготовитьМассивДисковДляПоиска();
НайтиФайлыНаДисках();



Сообщить("Работа завершена");