// Процедура при открытии обработки
//
Процедура ПриОткрытии()
	СохранитьДанныеВФайл(ПараметрЗапуска);
	ЗавершитьРаботуСистемы(Ложь);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтрокаПараметра = "";
	Попытка 
		СтрокаПараметра = ПараметрЗапуска;
	Исключение
	КонецПопытки;
	
	СохранитьДанныеВФайлНаСервере(СтрокаПараметра);
	Отказ=Истина;
	
	ЗавершитьРаботуСистемы(Ложь);
	
КонецПроцедуры

Процедура СохранитьДанныеВФайл(ПараметрЗапускаОбработки)
	
	Отчет = Новый ТекстовыйДокумент;
	
	ДатаНачала = ТекущаяДата();
	Отчет.ДобавитьСтроку(СокрЛП(ДатаНачала));
	
	Отчет.ДобавитьСтроку(ПараметрЗапускаОбработки);
	Отчет.ДобавитьСтроку(Метаданные.Версия);
	
	ДатаОкончания = ТекущаяДата();
	Отчет.ДобавитьСтроку(СокрЛП(ДатаОкончания));
	
	Отчет.Записать("C:\tmp\1Cmonitor.log","UTF-8");	
	
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеВФайлНаСервере(ПараметрЗапускаОбработки)
	
	Отчет = Новый ТекстовыйДокумент;
	
	ДатаНачала = ТекущаяДата();
	Отчет.ДобавитьСтроку(СокрЛП(ДатаНачала));
	
	Отчет.ДобавитьСтроку(ПараметрЗапускаОбработки);	
	Отчет.ДобавитьСтроку(Метаданные.Версия);
	
	ДатаОкончания = ТекущаяДата();
	Отчет.ДобавитьСтроку(СокрЛП(ДатаОкончания));
	
	Отчет.Записать("C:\tmp\1Cmonitor.log","UTF-8");	
	
	
КонецПроцедуры

